using System;
using System.Collections;
using System.Numerics;
namespace InfBez1
{
    class Program
    {
        public struct test
        {
            public int value;
            public int count;
        }

        static void Main(string[] args)
        {
            int alphaStart = 1071,
                alphaEnd = 1104,//границы кириллицы
                alphaNum = alphaEnd - alphaStart - 1;//число букв в алфавите
            string train = "оианеврлтмыдкспзхяйбгжучшьщюцэфъ";
            test[] newAlphabet = new test[alphaNum];
            string C = "щ  зсдлъэд фцяб  цоцюъбк сня пбь  емйюсцдъ й  цяъцк  йюцсцъб йюмсэъъбжэ яцжмжэ, м й ясыфцк - яьэъъбж цяъцгюмлъбж еямъэдж зця цяъцк исбудк,  ъдйжцюсн ъм юц, аюц цъц зсэъмяьдлмьц ядйнюимж щьмядьчшдщ. эе щйдо гюэо еямъэк юцьчиц ящм яцжм пбьэ лэьбжэ: яцж, фяд  фцйюэъэшм \"ицъюэъдъюмьч\", ям йюцнвэк сняцж й ъэж юсмиюэс дфцсцщм, еъмждъэюбк йщцэжэ пьэъмжэ.  цйюмьчъцд щйд ьмщиэ, щзьцюч яц ющдсйицк."
               + "\r\n" + "юсмиюэс  дфцсцщм  ицфям-юц  зсэъмяьдлмь щцсцъэъы,  э  ъм  щбщдйид  пбьм эецпсмлдъм щцсцъм,  ядслмвмн  щ  иьтщд пьэъ. щйд  ьмщиэ  цоцюъцфц сням  пбьэ жнйъбд, сбпъбд, м зця  ъэжэ едьдъъбд зцящмьб. емяъэд ящдсэ ьмщци щбоцяэьэ ъм цфсцжъбк  ящцс-жцъдюъбк,  ими  дфц  ъмебщмьэ  эеясдщьд.  ъм  ъдж  пбьэ юцлд цяъцгюмлъбд  жнйъбд,  лэщцсбпъбд  э нэаъбд  ьмщиэ,  м зцйсдяэъд--ящыогюмлъбк \"жцъдюъбк\"  юсмиюэс. щ емяъдк амйюэ ящцсм - сня  ймсмтуди й зцфсдпмжэ э иьмяцщбжэ, иэудщуэжэ зцьаэвмжэ исбй."
               + "\r\n" + "цоцюъбк  сня зцьыаэь  йщцд  ъмещмъэд  двд щ  юд  щсдждъм,  ицфям  еядйч смесдудъц пбьц юцсфцщмюч яэачт, зсэъцйэжцк зцяжцйицщъбжэ цоцюъэимжэ."
               + "\r\n" + "щздсдяэ  ьмщци, ъм зьцвмяэ, щяцьч  уэсцицфц юсцюымсм, йюцньэ здсдъцйъбд змьмюиэ   э   юцьзэьэйч   юцсфцщшб  й  ицсеэъмжэ  э   ждуимжэ,  ъмзцьъдъъбжэ щйдщцежцлъбжэ  зсцяыиюмжэ.  оцяэьэ цоцюъэиэ,  цпщдумъъбд  ыюимжэ, юдюдсимжэ, емкшмжэ. ы пмп эе ицсеэъ юцсамьэ фцьцщб иыс э шбзьню, щ ждуимо щэелмьэ зцсцйнюм,  ицюцсбо зсцямщшб, щбъэжмн эе ждуим,аюцпб  зцимемюч  зциызмюдьт,  ъдзсдждъъц зцяъэжмьэ  ъмя  фцьцщцк,  ядслм ем йщнемъъбд  емяъэд  ъцфэ.  ъм  жцйюцщцк  здсдя  змьмюимжэ  йъцщмьэ зэсцлъэиэ, пьэъъэиэ,  юцсфцщшб фсдаъдщэимжэ,  лмсдъъбжэ  ъм зцйюъцж  жмйьд. йпэюдъвэиэ смеьэщмьэ, зц ицздкид ем  йюмимъ,  фцснаэк йпэюдъч - ьтпэжбк  юцфям ждяцщбк"
               + "\r\n" + "ъмзэюци, йцфсдщмщуэк эещцеаэицщ э йьылмвэо,  емждсемщуэо щ оцьцяъбо  ьмщимо. ьдюцж  йпэюдъвэицщ  йждъньэ юцсфцщшб  ищмймжэ, э  ймжбк  ьтпэжбк эе ъэо  пбь фсыудщбк, эе  щмсдъбо  фсыу,  ицюцсбд  щ  жцадъцж  щэяд ьдлмьэ  яьн  зсцямлэ зэсмжэямжэ ъм ьцюимо, м ищмй адсзмьэ эе щдясм исылимжэ. жнйъбд э сбпъбд ьмщиэ йцйюцньэ эе  ящыо цюядьдъэк. щ  здсщцж ьдлмьц ъм зцьимо жнйц смеъбо йцсюцщ - яэач, иысб, фыйэ, эъядкиэ, змьдъбд зцсцйнюм яьн лмсицфц  э щ ьдянъбо  щмъъмо - пдьбд зцсцйнюм  яьн емьэщъцфц.  ъм истачно  зц йюдъмж пбьэ смещдумъб юыуэ пмсмуицщ э  зцдъъбо жцьцицж юдьню, м щдйч зцюцьци емъню  цицсцимжэ  щйдщцежцлъбо смеждсцщ э  зсэфцюцщьдъэк--ицзадъбо, щмсдъбо, зсцщдйъбо. щц щюцсцж  цюядьдъээ, юджъцж,  цйщдвдъъцж юцьчиц ящдсчт  щц ящцс, щэйдьэ ядйнюиэ жнйъбо  юыу. зця щйджэ ьмщимжэ -- зцящмьб. цоцюъбк  сня пбщмь цйцпдъъц  цлэщьдъъбж  здсдя  пцьчуэжэ  зсмеяъэимжэ.  и ьмщимж  зцяхделмьэ ъм юбйнаъбо сбймимо смйрсмъадъъбд иызаэоэ, э ем ъэжэ йьылмвэд щбъцйэьэ эе ьмщци"
            , win = "";
            Console.WriteLine("Зашифрованный текст");
            Console.WriteLine(C);
            for (int i = 0; i < newAlphabet.Length; i++)
            {
                newAlphabet[i].count = i + 1;
            }//нумеруем буквы

            for (int i = 0; i < C.Length; i++)
            {
                int temp = (int)C[i] - alphaStart;
                if (temp > 0 && temp <= alphaNum)
                    newAlphabet[temp - 1].value++;
            }//считаем, сколько каких букв в тексте

            for (int i = 1; i < newAlphabet.Length; i++)
                for (int j = i; j > 0; j--)
                    if (newAlphabet[j].value > newAlphabet[j - 1].value)
                    {
                        test temp = newAlphabet[j - 1];
                        newAlphabet[j - 1] = newAlphabet[j];
                        newAlphabet[j] = temp;
                    }//сортировка пузырьком по частоте появления

            for (int i = 0; i < C.Length; i++)
            {
                int temp = (int)C[i] - alphaStart;
                if (temp > 0 && temp <= alphaNum)
                {
                    for (int j = 0; j < alphaNum; j++)
                        if (newAlphabet[j].count == temp)
                        {
                            win += train[j];
                            break;
                        }
                }
                else
                    win += C[i];
            }//сравниваем
            Console.WriteLine();
            Console.WriteLine();
            Console.WriteLine();
            Console.WriteLine("Расшифрованный текст:");
            Console.WriteLine(win);
            Console.ReadKey();
        }
    }
}
